init.org
replace setq with gsetq, or delete gsetq-* aliaseds and use csetq
bookmarks
org-mode
projectile?
use special face for hydra-prefix
show lines between folded nodes
investigate notes about :custom bug and extract the cause. DOes it apply when using csetq or gsetq but not use-package?

[x] Color theme
[x] Font
[x] Move to newly split windows, splitbelow, splitright
[] Change what evil considers to be a word (iskeyword)
[] Change which horiz movements can cross lines (whichwrap)
[x] Make tabs visible
[x] Break lines at 80 chars (auto-fill-mode)
[x] Disable temp files (auto save and backup files)
[] Truecolor for terminal? Not currently using terminal
[] Terminal configuration (neoterm, nvr)
[x] Remove trailing whitespace on write
[x] nerdcommenter
[] Enable manual indentation? See https://www.pement.org/emacs_tabs.htm#nothing for an
explanation and note that a better option may be to improve a mode's autoindentation.
[] Fix tab. Currently it doesn't tab at all. Indentation seems to be forced in lisp mode.
[] undotree
[] vim-clap
[] floating terminal
[] vimwiki
[] grep commands (bind to spc f g)
[] R (polymode and ess; note polymode has its own website similar to lsp-mode)
[] python (emacs-jupyter?)
[x] Replicate coc.nvim
[x] Floating help next to completion items: company-box!
[x] Callable help: lsp-ui-doc-glance and company-show-doc-buffer
[x] Scrollable help: custom lisp function
[x] Fuzzy file finder that searches all subdirs? See counsel-fzf
[] Make graphical emacs not started from Terminal use $PATH in exec-path
See https://github.com/purcell/exec-path-from-shell
[] Ensure page breaks are enabled such that ^H isn't visible in help(?) docs
[] mode-line-format customization?
[x] Highlight parens (see show-paren-mode and evil-highlight-closing-paren-at-point states)
[x] Customize background,foreground face for show-paren-mode
[] Does evil-highlight-closing-paren-at-point affect this?
[] Improve company selected completion item face for this theme (it's barely visible)
NOTE: Appears to only affect the WSL version of emacs...
[] Update plugins and __init.el
[] Review ivy/counsel/swiper changelog, wiki, and external website to see what's changed
and what I missed the first time I started using emacs. E.g., I bound both fzf and
jump to my files hydra, even though they are presumably similar commands.
[] counsel-el is deprecated. (Try running the command for suggested fix).
Change the binding at the bottom of init.el

* package manager                                                   :ARCHIVE:
#+BEGIN_SRC emacs-lisp :tangle yes
  ;; https://github.com/raxod502/straight.el#getting-started
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  ;; https://github.com/raxod502/straight.el#integration-with-use-package
  ;; https://github.com/raxod502/straight.el#integration-with-use-package-1
  ;; (straight-use-package 'use-package)
  ;; (setq straight-use-package-by-default t)

  ;; https://github.com/jwiegley/use-package#diminishing-and-delighting-minor-modes
  (straight-use-package 'diminish)
#+END_SRC

* customization
#+begin_src emacs-lisp :tangle yes
  ;; Customizations unrelated to straight-managed packages
  (setq custom-file "~/.emacs.d/emacs-custom.el")
  (load custom-file)
  ;; (setq custom-file null-device)

  ;; https://github.com/jwiegley/use-package/pull/881
  (defun customize-package (&rest args)
    (let ((custom--inhibit-theme-enable nil)) ; Apply changes to theme immediately
      (apply 'custom-theme-set-variables 'my-theme args)))

  (deftheme my-theme)
  ;; Assign my-theme second-highest precedence (after user theme). Note that load-theme invocations lower down will set
  ;; the loaded theme to a higher precedence
  (enable-theme 'my-theme)
#+end_src
* et cetera
** load-path
#+begin_src emacs-lisp :tangle yes
  (setq load-path (cons "~/.emacs.d/lisp" load-path))
#+end_src
** default-directory
#+begin_src emacs-lisp :tangle yes
  (setq-default default-directory "~/.emacs.d")
#+end_src
** default font
#+begin_src emacs-lisp :tangle yes
  (set-frame-font "Hack 10" nil t)
#+end_src
** exec-path
#+begin_src emacs-lisp :tangle no
  (add-to-list 'exec-path "/usr/local/bin")
  (setq python-shell-interpreter "python3")
#+end_src
** Windows Subsystem for Linux
Open links outside of WSL

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (string-match "Linux.*Microsoft.*Linux"
                      (shell-command-to-string "uname -a"))
    (setq browse-url-generic-program "/mnt/c/Windows/System32/cmd.exe"
          browse-url-generic-args '("/c" "start" "")
          browse-url-browser-function 'browse-url-generic))
#+END_SRC
** view-mode
Enable "q" for quit from view-mode by converting all buffers to motion state upon view mode entry. As a minor mode,
it doesn't otherwise override the major mode's evil state upon view-mode entry.

#+begin_src emacs-lisp :tangle no
  (add-hook 'view-mode-hook 'evil-motion-state)
#+end_src
** Color Theme
See https://emacsthemes.com for themes

#+begin_src emacs-lisp :tangle yes
  (straight-use-package 'solarized-theme)
  (load-theme 'solarized-dark t)
#+end_src
** Line Wrapping
1. Default behavior is soft wrapping and word-splitting at the right window edge.
2. visual-line-mode soft wraps at right window edge and avoids word splitting.
3. auto-fill-mode hard wraps at fill-column, which can be displayed via display-fill-column-indicator-mode.
4. toggle-truncate-lines truncates lines instead of wrapping.

Numerous modes should not hard-wrap: org-mode to avoid having to format each line where text with formatting (e.g., bolding) runs across multiple lines; Rmarkdown, since some output formats (e.g., Word) do not hard-wrap paragraph blocks; and terminals.

org-indent-mode indents nested lines and shows column 0 at the indented position, not at the start of the line. So technically there should be a fill line for each indented section. The text is still wrapping at fill-column amount of characters; however, it doesn't appear that way because fill-column doesn't adjust the displayed indicator for indented org sections. Thus, even if soft wrapping were enabled, you would want to disable the fill indiciator.

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun no-auto (&optional wrap-mode)
    "Disable auto fill and indicator for specific modes"
    (turn-off-auto-fill) ; (auto-fill-mode -1)
    (display-fill-column-indicator-mode -1)
    (if wrap-mode
        (funcall wrap-mode)))

  ;; Default to hard wrapping at lines at column 80 in all modes
  (setq-default auto-fill-function 'do-auto-fill)
  (setq-default fill-column 120)

  (add-hook 'org-mode-hook (lambda () (no-auto 'visual-line-mode)))
  (add-hook 'markdown-mode-hook (lambda () (no-auto 'visual-line-mode)))
  (add-hook 'term-mode-hook (lambda () (no-auto) (toggle-truncate-lines 1))) ; Fish shell in ansi-term
  (add-hook 'custom-mode-hook (lambda () (no-auto)))
#+END_SRC

*** Sources
1. https://www.gnu.org/software/emacs/manual/html_node/emacs/Continuation-Lines.html#Continuation-Lines
2. https://www.gnu.org/software/emacs/manual/html_node/efaq/Turning-on-auto_002dfill-by-default.html

*** TODO Investigate how auto-fill-mode interacts with auto-fill-function and which modes set values other than 'do-auto-fill
*** TODO Rewrite no-auto for term-mode-hook
** page-break-lines
#+begin_src emacs-lisp :tangle yes
  (straight-use-package 'page-break-lines)
#+end_src
** command-log
#+begin_src emacs-lisp :tangle yes
  (customize-package
   '(command-log-mode-auto-show nil)
   '(command-log-mode-is-global t)
   '(command-log-mode-key-binding-open-log nil)
   '(command-log-mode-open-log-turns-on-mode nil)
   '(command-log-mode-window-size 50))

  (straight-use-package 'command-log-mode)
  (command-log-mode)
  (diminish 'command-log-mode)

  ;; Auto-scroll buffer as commands are logged
  (add-hook 'command-log-mode-hook (lambda () (set (make-local-variable 'window-point-insertion-type) t)))
#+end_src
** ace-window
#+begin_src emacs-lisp :tangle yes
  (customize-package
   '(aw-keys '(97 115 100 102 103 104 106 107 108)))

  (straight-use-package 'ace-window)
#+end_src

* general
#+BEGIN_SRC emacs-lisp :tangle yes
  (straight-use-package 'general)

  (general-create-definer my-leader
    :states '(motion insert emacs)
    :prefix "SPC"
    :non-normal-prefix "C-SPC")

  ;; Top-level mappings
  (my-leader
    "" nil ; Unbinding the prefix itself prevents errors about binding to non-prefix keys somehow
    "." 'clm/toggle-command-log-buffer
    "&" 'async-shell-command
    "e" 'eshell
    "f" '(:prefix-command my/files-map :wk "files")
    "t" 'ansi-term)

  ;; Files
  (general-def my/files-map
    :wk-full-keys nil ; Allows for consistent wk replacement text during cyclical map navigation
    "b" '(:prefix-command my/bookmarks-map :wk "bookmarks")
    "i" 'insert-file)

  ;; Bookmarks
  (general-def my/bookmarks-map
    :wk-full-keys nil
    "d" 'bookmark-delete
    "e" 'edit-bookmarks
    ;; For each map referencing `my/files-map' we need `:wk' "files"
    "f" '(my/files-map :wk "files")
    "r" 'bookmark-rename
    "s" 'bookmark-set)

  ;; Help
  (general-unbind help-map "C-d" "s" "B" "C" "L" "g" "h" "n" "M-c" "RET" "C-n" "C-p" "C-t" "C-\\")
  (general-def help-map "M" 'describe-minor-mode)

#+END_SRC

** TODO Configure buffer/window of output from async-shell-command
** TODO Play around with bookmarks sometime. How can they be used in addition to fzf, ripgrep (rg), and other search commands?
Possibly b/c the latter tend to operate in the current directory, while bookmarks can jump directories.

