init.el
;; https://github.com/raxod502/straight.el#getting-started
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

;; https://github.com/raxod502/straight.el#integration-with-use-package
;; https://github.com/raxod502/straight.el#integration-with-use-package-1
;; (straight-use-package 'use-package)
;; (setq straight-use-package-by-default t)

;; https://github.com/jwiegley/use-package#diminishing-and-delighting-minor-modes
(straight-use-package 'diminish)

;; Customizations unrelated to straight-managed packages
(setq custom-file "~/.emacs.d/emacs-custom.el")
(load custom-file)
;; (setq custom-file null-device)

;; https://github.com/jwiegley/use-package/pull/881
(defun customize-package (&rest args)
  (let ((custom--inhibit-theme-enable nil)) ; Apply changes to theme immediately
    (apply 'custom-theme-set-variables 'my-theme args)))

(defun customize-package-face (&rest args)
  (let ((custom--inhibit-theme-enable nil)) ; Apply changes to theme immediately
    (apply 'custom-theme-set-faces 'my-theme args)))

(deftheme my-theme)
;; Assign my-theme second-highest precedence (after user theme). Note that load-theme invocations lower down will set
;; the loaded theme to a higher precedence
(enable-theme 'my-theme)

(setq load-path (cons "~/.emacs.d/lisp" load-path))

(setq-default default-directory "~/.emacs.d")

(set-frame-font "Hack 10" nil t)

(when (string-match "Linux.*Microsoft.*Linux"
                    (shell-command-to-string "uname -a"))
  (setq browse-url-generic-program "/mnt/c/Windows/System32/cmd.exe"
        browse-url-generic-args '("/c" "start" "")
        browse-url-browser-function 'browse-url-generic))

(straight-use-package 'solarized-theme)
(load-theme 'solarized-dark t)

(defun no-auto (&optional wrap-mode)
  "Disable auto fill and indicator for specific modes"
  (turn-off-auto-fill) ; (auto-fill-mode -1)
  (display-fill-column-indicator-mode -1)
  (if wrap-mode
      (funcall wrap-mode)))

;; Default to hard wrapping at lines at column 80 in all modes
(setq-default auto-fill-function 'do-auto-fill)
(setq-default fill-column 120)

(add-hook 'org-mode-hook (lambda () (no-auto 'visual-line-mode)))
(add-hook 'markdown-mode-hook (lambda () (no-auto 'visual-line-mode)))
(add-hook 'term-mode-hook (lambda () (no-auto) (toggle-truncate-lines 1))) ; Fish shell in ansi-term
(add-hook 'custom-mode-hook (lambda () (no-auto)))

(straight-use-package 'page-break-lines)

(customize-package
 '(command-log-mode-auto-show nil)
 '(command-log-mode-is-global t)
 '(command-log-mode-key-binding-open-log nil)
 '(command-log-mode-open-log-turns-on-mode nil)
 '(command-log-mode-window-size 50))

(straight-use-package 'command-log-mode)
(command-log-mode)
(diminish 'command-log-mode)

;; Auto-scroll buffer as commands are logged
(add-hook 'command-log-mode-hook (lambda () (set (make-local-variable 'window-point-insertion-type) t)))

(customize-package
 '(aw-keys '(97 115 100 102 103 104 106 107 108)))

;; Larger ace-window letters (https://oremacs.com/2015/02/27/ace-window-leading-char/)
(customize-package-face
 '(aw-leading-char-face ((t (:inherit ace-jump-face-foreground :height 3.0)))))

(straight-use-package 'ace-window)

(straight-use-package 'general)

(general-create-definer my-leader
  :states '(motion insert emacs)
  :prefix "SPC"
  :non-normal-prefix "C-SPC")

;; Top-level mappings
(my-leader
  "" nil ; Unbinding the prefix itself prevents errors about binding to non-prefix keys somehow
  "." 'clm/toggle-command-log-buffer
  "&" 'async-shell-command
  "e" 'eshell
  "f" '(:prefix-command my/files-map :wk "files")
  "t" 'ansi-term)

;; Files
(general-def my/files-map
  :wk-full-keys nil ; Allows for consistent wk replacement text during cyclical map navigation
  "b" '(:prefix-command my/bookmarks-map :wk "bookmarks")
  "i" 'insert-file)

;; Bookmarks
(general-def my/bookmarks-map
  :wk-full-keys nil
  "d" 'bookmark-delete
  "e" 'edit-bookmarks
  ;; For each map referencing `my/files-map' we need `:wk' "files"
  "f" '(my/files-map :wk "files")
  "r" 'bookmark-rename
  "s" 'bookmark-set)

;; Help
(general-unbind help-map "C-d" "s" "B" "C" "L" "g" "h" "n" "M-c" "RET" "C-n" "C-p" "C-t" "C-\\")
(general-def help-map "M" 'describe-minor-mode)

(customize-package
 '(which-key-idle-delay 0.2)
