init.org
* which-key

There are split code blocks to enable testing of the config with and without which-key loaded. ~disable-transient-map-temporarily~ is used to advise functions from other packages and must be available even if which-key is not. For this reason, it is written to run even if which-key is not loaded.

#+BEGIN_SRC emacs-lisp :tangle yes
  (customize-package
   '(which-key-idle-delay 0.2)
   '(which-key-show-docstrings t)
   '(which-key-allow-evil-operators nil)
   '(which-key-allow-imprecise-window-fit t)
   '(which-key-compute-remaps t) ; E.g. w/ counsel-mode: apropos-command -> counsel-apropos
   '(which-key-max-description-length 100)
   '(which-key-popup-type 'side-window)
   '(which-key-side-window-location 'bottom)
   '(which-key-prefix-prefix "+")
   '(which-key-separator " ")
   '(which-key-show-operator-state-maps nil) ; Enabling leads to rapid timeout for evil (e.g., 10dj or d10j)
   '(which-key-show-transient-maps t) ; See modified which-key--update in my fork
   '(which-key-side-window-max-height 0.1)
   '(which-key-sort-order 'which-key-key-order-alpha)
   '(which-key-sort-uppercase-first nil))

  (straight-use-package
   '(which-key :type git :host github :repo "justbur/emacs-which-key"
               :fork (:host github :repo "jkroes/emacs-which-key")))

  (which-key-mode)
  (diminish 'which-key-mode)

  (general-def :keymaps 'help-map
    "C-h" nil ; Enable which-key navigation of help-map bindings
    "C-w" 'which-key-show-keymap)
#+end_src

#+begin_src emacs-lisp :tangle yes
  (defun disable-transient-map-temporarily (orig-fun &rest args)
    "Hide which-key popup for certain transient maps"
    (if (bound-and-true-p which-key-show-transient-maps)
        (progn
          (setq which-key-show-transient-maps nil)
          (apply orig-fun args)
          (setq which-key-show-transient-maps t))
      (apply orig-fun args)))
#+end_src

* hydra

To enable which-key paging, hydras must be pink. Otherwise you can still page to find what you want, but this will exit the hydra. You will have to reenter all prefix keys again to reach the desired binding.

#+BEGIN_SRC emacs-lisp :tangle yes
  (customize-package
   '(hydra-verbose t)
   '(hydra-is-helpful t))

  (straight-use-package 'hydra)

  (my-leader
    "b" 'hydra-buffer/body
    "w" 'hydra-window/body)

  ;; Required order of operations:
  ;; 1. Modify hydra-base-map
  ;; 2. defhydra evaluation
  ;; 3. defhydra+ evaluation
  ;; 4. my/defhydra
  ;; Some defhydra(+) rely on with-eval-after-load. To ensure my/defhydra is evaluated last, these are loaded after all
  ;; packages that contribute functions/heads to these hydras.
  ;; NOTE: I had issues surrounding defhydra+ with with-eval-after-load declarations.
  (defun counsel-hydra-integrate (old-func &rest args)
    "Function used to advise `counsel-hydra-heads' to work with blue and amranath hydras."
    (hydra-keyboard-quit)
    (apply old-func args)
    (funcall-interactively hydra-curr-body-fn))

  (defun ess-r-mode-hydras ()
    "Hook for ess-r-mode. The functions used as hydra heads do not exist until an ess-r-mode buffer exists, so
        my/defhydra must be called after that buffer is created."
    (my/defhydra 'hydra-r)
    (my/defhydra 'hydra-r-help)
    (my/defhydra 'hydra-r-eval)
    (my/defhydra 'hydra-r-debug)) ; Display hydras in which-key

  (defun treemacs-mode-hydras ()
    "Can't simply call my/defhydra2 on treemacs-helpful-hydra, because the function that toggles the hydra also
        creates the hydra on its first invocation."
    (treemacs-helpful-hydra)
    (my/defhydra2 'treemacs--helpful-hydra)
    ;; So the hydra doesn't show the first time treemacs is called
    (treemacs--helpful-hydra/nil))

  (advice-add 'counsel-hydra-heads :around 'counsel-hydra-integrate)
  (general-def hydra-base-map "." 'counsel-hydra-heads)
  (load "my-hydras")

  (with-eval-after-load "which-key"
    (customize-package '(hydra-is-helpful nil)) ; Disable in favor of which-key-show-transient-maps and which-key hacks
    (load "which-key-hacks")
    (add-hook 'ess-r-mode-hook 'ess-r-mode-hydras)
    (add-hook 'treemacs-mode-hook 'treemacs-mode-hydras)
    ;; (with-eval-after-load "ivy-hydra" (my/defhydra 'hydra-ivy))
    (with-eval-after-load "counsel"
      (with-eval-after-load "evil"
        (with-eval-after-load "ace-window"
          (my/defhydra 'hydra-buffer)
          (my/defhydra 'hydra-window)))))
#+END_SRC

** TODO Rewrite my/defhydra so that you don't have to use with-eval-after-load

which-key has changed its documentation API, so you might be able to use that instead to better effect.

** TODO Add an action to counsel-fzf and other file commands to open files as read-only buffers
This will help avoid accidentally altering files you simply want to read.

** TODO Make sure every hydra head is an autoload in each hydra

** TODO Make hydra-ivy work with my/defhydra
More generally, figure out how to accept hydras of different structures. Neither my/defhydra nor my/defhydra2 work for hydra-ivy, so clearly something is going on to allow all these different structures.
Alternatively, redefine the hydras yourself to get the desired structure.

* [[https://github.com/abo-abo/swiper][ivy/counsel/swiper]]
A good expalantion of the difference between ivy-mode and counsel-mode: https://github.com/abo-abo/swiper/issues/120. E.g., ivy-mode enables ivy-based completion for describe-function, but counsel-describe-function provides an extra action to jump to definition (alt-O-d) and replaces describe-function with counsel-describe-function.

Usage within minibuffer: C-h m
Accept current candidate: C-j
Accept current input: C-M-j
Toggle hydra-ivy: C-o
- ivy-rotate-preffered-builders (M) to swap regex style per ivy-preferred-re-builders
ivy-rotate-sort (C-c C-s)

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq ivy-re-builders-alist '((swiper . ivy--regex)
                                (t . ivy--regex-fuzzy))
        ivy-help-file "~/.emacs.d/ivy-help.org")

  (customize-package
   '(ivy-count-format "%d/%d ")
   ;; BUG: C-u counsel-fzf, then C-j on candidate '..' prevents ivy from dispaying counsel-fzf results
   '(ivy-extra-directories nil)
   ;; View more results in minibuffer
   '(ivy-height 25)
   ;; Don't anchor beginning of regex queries implicitly
   '(ivy-initial-inputs-alist nil)
   ;; Separates functionality for ivy-switch-buffer and counsel-recentf
   '(ivy-use-virtual-buffers nil)
   ;; For counsel-find-file. See also remapping of ivy-done and ivy-alt-done
   '(counsel-bookmark-avoid-dired t)
   ;; Affects counsel-recentf. Possibly also ivy-switch-buffer with ivy-use-virtual-buffers enabled.
   '(recentf-max-saved-items 100))

  ;; Repo is swiper, but built as three separate packages: ivy, counsel, swiper
  (straight-use-package 'counsel)
  ;; Straight splits repos/swiper into build/ivy, build/counsel, and build/swiper. It omits a number of files, including
  ;; ivy-hydra.el. I do not know all such packages, but I do know I need to install ivy-hydra separately. NOTE: To see
  ;; recipes for each, use straight-get-recipe
  (straight-use-package 'ivy-hydra) ; provides hydra-ivy
  (diminish 'counsel-mode)
  (ivy-mode)
  (counsel-mode)

  (my-leader "SPC" 'execute-extended-command)
  (general-def :keymaps 'help-map "s" 'describe-symbol)
  (general-def :keymaps 'my/files-map
    ;; TODO: Add an action to change dir similar to C-u
    "f" 'counsel-fzf
    ;; https://beyondgrep.com/feature-comparison/
    "g" 'counsel-rg
    "m" 'counsel-recentf
    "s" 'swiper)
  (general-def :keymaps 'my/bookmarks-map
    "D" 'counsel-bookmarked-directory
    ;; TODO: Customize counsel-bookmark action list to include delete, rename, and set
    "j" 'counsel-bookmark)
  (general-def :keymaps 'ivy-minibuffer-map
    "M-m" 'ivy-mark
    "M-u" 'ivy-unmark
    ;; For counsel-find-file, RET should add dir to search path instead of pulling up dired
    [remap ivy-done] 'ivy-alt-done
    [remap ivy-alt-done] 'ivy-done)

  (customize-package '(smex-history-length 100)) ; Longer command history for sorting counsel-M-x results
  (straight-use-package 'smex) ; For counsel-M-x

  (straight-use-package 'flx) ; For anything using ivy--regex-fuzzy
#+END_SRC

** TODO Create sorting function to prioritize shorter matches over longer ones, anchored over non-anchored
E.g., customize above customize-* above *-customize. ivy doesn't seem to provide many sorting functions. When you create one, add it to ivy-sort-functions-alist. When there are multiple functions per command, ivy-rotate-sort will finally work.

