init.org
* helm
#+BEGIN_SRC emacs-lisp :tangle yes
  ;; Dependencies for source build of helm
  ;; (straight-use-package 'async)
  ;; (straight-use-package 'popup)

  ;; Source installation, per helm recommendation
  ;; - https://github.com/emacs-helm/helm/wiki#from-source (installation)
  ;; - https://github.com/emacs-helm/helm/wiki#if-installed-from-source (configuration)
  ;; (add-to-list 'load-path "/usr/local/share/emacs/site-lisp/helm/") ; facultative when installed with make install
  ;; (require 'helm-config)
  ;; (my-leader
  ;;   "SPC" 'helm-M-x)
  ;; (use-package helm-fzf
  ;;   :straight (helm-fzf :type git :host github :repo "ibmandura/helm-fzf"))
  ;; From emacs-helm.sh
  ;; (helm-mode 1)
  ;; (define-key global-map [remap find-file] 'helm-find-files)
  ;; (define-key global-map [remap occur] 'helm-occur)
  ;; (define-key global-map [remap list-buffers] 'helm-buffers-list)
  ;; (define-key global-map [remap dabbrev-expand] 'helm-dabbrev)
  ;; (define-key global-map [remap execute-extended-command] 'helm-M-x)
  ;; (define-key global-map [remap apropos-command] 'helm-apropos)
  ;; (unless (boundp 'completion-in-region-function)
  ;;   (define-key lisp-interaction-mode-map [remap completion-at-point] 'helm-lisp-completion-at-point)
  ;;   (define-key emacs-lisp-mode-map       [remap completion-at-point] 'helm-lisp-completion-at-point))
  ;; (add-hook 'kill-emacs-hook #'(lambda () (and (file-exists-p "$CONF_FILE") (delete-file "$CONF_FILE"))))

  ;; (use-package dash)
  ;; (use-package f)
  ;; (use-package s)
  ;; (use-package helm-org-rifle)


#+END_SRC

* evil
#+BEGIN_SRC emacs-lisp :tangle yes
  (setq evil-normal-state-modes
        '(lisp-interaction-mode                         ; *scratch*
          messages-buffer-mode
          emacs-lisp-mode
          python-mode
          ess-r-mode
          sh-mode
          fish-mode
          markdown-mode
          fundamental-mode
          lua-mode
          org-mode
          SAS-mode)
        evil-insert-state-modes
        '(inferior-ess-r-mode))

  (customize-package
   '(evil-default-state 'emacs)
   '(evil-emacs-state-modes nil)
   ;; Highlight closing paren at point in normal, before point in listed modes
   '(evil-highlight-closing-paren-at-point-states '(not emacs insert replace))
   '(evil-insert-state-modes nil)
   '(evil-intercept-maps nil)
   ;; Read-only modes start in default mode (should be emacs)
   '(evil-motion-state-modes nil nil nil)
   '(evil-overriding-maps nil)
   '(evil-split-window-below t)
   '(evil-undo-system 'undo-fu)
   '(evil-vsplit-window-right t)
   '(evil-want-keybinding nil))

  (straight-use-package 'evil)
  (evil-mode)

  ;; (defalias 'evil-insert-state 'evil-emacs-state)    ; Alternative to disabling insert-state bindings
  (advice-add 'evil-search-forward :around 'disable-transient-map-temporarily)
  (advice-add 'evil-search-backward :around 'disable-transient-map-temporarily)

  ;; For evil undo/redo operations
  (straight-use-package 'undo-fu)

  (customize-package
   '(evil-escape-delay 0.2)
   '(evil-escape-mode t)
   '(evil-escape-key-sequence "kj"))

  (straight-use-package 'evil-escape)
  (evil-escape-mode)
  (diminish 'evil-escape-mode)

  ;; (straight-use-package evil-surround)
#+END_SRC

* comments
See the README for examples, evil usage, and tips

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun counsel-imenu-comments ()
    "Use counsel to display comments in current buffer"
    (interactive)
    (let* ((imenu-create-index-function 'evilnc-imenu-create-index-function))
      (unless (featurep 'counsel) (require 'counsel)) ; !Alternative to with-eval-after-load?!
      (counsel-imenu)))

  (straight-use-package 'evil-nerd-commenter)

  (my-leader
    "c" '(:ignore t :wk "comments")
    "cc" 'evilnc-comment-or-uncomment-lines
    "cC" 'evilnc-copy-and-comment-lines
    "ci" 'counsel-imenu-comments
    ;; When given C-u <n>, will forward-match <n> against the rightmost
    ;; digits of each line. E.g., on line 160, C-u <72> will target lines
    ;; 160-172
    "cl" 'evilnc-quick-comment-or-uncomment-to-the-line
    "cp" 'evilnc-comment-or-uncomment-paragraphs
    "cy" 'evilnc-comment-and-kill-ring-save
    ;; Whether empty lines can be commented as part of a selection
    "ce" 'evilnc-toggle-comment-empty-lines
    ;; When toggled off, all lines in a selection are commented if any
    ;; uncommented lines are included. Note that blank lines never count
    "cv" 'evilnc-toggle-invert-comment-line-by-line
    "c," 'evilnc-comment-operator
    "c." 'evilnc-copy-and-comment-operator)

#+END_SRC

