init.el
 '(org-M-RET-may-split-line '((default)))
 '(org-agenda-include-diary t)
 '(org-agenda-restore-windows-after-quit t)
 '(org-agenda-todo-ignore-scheduled 'future)
 '(org-agenda-window-setup 'current-window)
 '(org-attach-dir-relative t)
 '(org-capture-bookmark nil)
 '(org-catch-invisible-edits 'show)
 '(org-cycle-separator-lines 0)
 '(org-default-notes-file "~/.emacs.d/org/.notes")
 '(org-directory "~/.emacs.d/org")
 '(org-enforce-todo-checkbox-dependencies t)
 '(org-enforce-todo-dependencies t)
 '(org-hide-emphasis-markers t)
 '(org-link-frame-setup
   '((vm . vm-visit-folder-other-frame)
     (vm-imap . vm-visit-imap-folder-other-frame)
     (gnus . org-gnus-no-new-news)
     (file . find-file)
     (wl . wl-other-frame)))
 '(org-list-allow-alphabetical t)
 '(org-log-done 'time)
 '(org-log-into-drawer nil)
 '(org-log-redeadline 'time)
 '(org-log-reschedule 'time)
 '(org-mark-ring-length 20)
 '(org-modules
   '(ol-bbdb ol-bibtex ol-docview ol-eww ol-gnus ol-info ol-irc ol-mhe ol-rmail ol-w3m))
 '(org-pretty-entities t nil nil "Affects manually typed entities (e.g., \"\\theta\"). org-counsel-entities inserts the actual UTF-8 character.")
 '(org-pretty-entities-include-sub-superscripts nil)
 '(org-projectile-projects-file "projects.org")
 '(org-return-follows-link t)
 '(org-src-window-setup 'current-window)
 '(org-startup-folded nil)
 '(org-startup-indented t)
 '(org-todo-keyword-faces
   '(("TODO" . org-warning)
     ("STARTED" . "yellow")
     ("DONE" . "green")
     ("WAITING" . "blue")))
 '(org-todo-keywords
   '((sequence "TODO(t)" "WAITING(w@/!)" "STARTED(s!)" "|" "DONE(d)")))
 '(org-use-fast-todo-selection 'expert))

(customize-package
 '(org-structure-template-alist '(("e" . "src emacs-lisp :tangle yes")
                                  ("r" . "src R :tangle no")
                                  ("p" . "src python :tangle no"))))

(if (file-directory-p "/mnt/d/org") ; Using work PC
    (setq org-agenda-files (append org-agenda-files "mnt/d/org")))

(load "my-org-functions.el")
(add-hook 'org-after-todo-statistics-hook 'my/org-summary-todo)

(my-leader "o" '(:prefix-command my/global-org-map :wk "org-global"))
(general-def my/global-org-map
  :wk-full-keys nil
  "a" 'org-agenda ; Dispatcher
  "c" 'counsel-org-capture ; Capture to org-default-notes-file
  "e" 'counsel-org-entity ; https://orgmode.org/manual/Special-Symbols.html
  "l" 'org-insert-link-global
  "o" 'org-open-at-point-global)

(my-leader :keymaps 'org-mode-map "m" 'my/org-map)
(general-define-key
 :prefix-command 'my/org-map
 ;; Highly varied. For list items, with prefix create checkbox else toggle
 ;; May affect multiple lines if on bullet point of outermost sublist's first
 ;; item. For cookies, update statistics.
 "SPC" 'org-ctrl-ctrl-c
 "." 'org-time-stamp ; Create or update existing timestamp
 "," 'org-insert-structure-template ; E.g. src block
 "d" 'org-deadline ; Insert deadline keyword with timtestamp
 "f" 'counsel-org-file ; Show attachments for current file
 ;; Not clear what the diff is b/w counsel-org-goto and counsel-org-goto-all,
 ;; except taht that latter produces more candidates
 "g" 'counsel-org-goto-all
 "s" 'org-schedule ; Insert schedule keyword with timestamp
 "!" 'org-time-stamp-inactive
 "I" 'org-clock-in
 "O" 'org-clock-out
 "Q" 'org-clock-cancel
 "^" 'org-sort ; Sort headings or list items
 "*" 'org-ctrl-c-star ; Complex (de)convert/toggle to heading
 "@" 'org-mark-subtree ; I was too lazy to look at yanking/pasting
 ;; Complex convert to list item(s) or cycle list level through bullet types
 "-" 'org-ctrl-c-minus
 "A" 'org-toggle-archive-tag ; Tag subtrees as non-tab-expandable
 "a" 'org-attach
 ;; Insert link or edit invisible URL portion of existing link with a
 ;; description. Backspace at beginning or end of displayed description will
 ;; remove start or end brackets, revealing the invisble portion of the link.
 ;; Selected text when inserting becomes link description.
 "l" 'org-insert-link
 "n" 'org-next-link
 ;; When calling in org file, link points to the current headline of file. For
 ;; other files, points to current line.
 "S" 'org-store-link
 ;; Headings whose parent has this property can not be marked done until
 ;; siblings on earlier lines are done
 "o" 'org-toggle-ordered-property
 ;; Cycle keywords. If switching from TODO to DONE for a repeating task, update
 ;; the timestamp by the amount of the repeater, and reset the keyword to
 ;; TODO. In contrast, C-- 1 C-c C-t permanently finishes the repeating
 ;; task. Repeating tasks are indicated as e.g. +5d, while alerts/reminders as
 ;; e.g. -4m. If you miss several due dates, you may want to update the
 ;; timestamp only once for all of these missed deadlines to a future date. This
 ;; requires ++ instead of +. The .+ repeater likewise updates to a future date,
 ;; but the new timestamp is relative to the completion time rather than the
 ;; timestamp. Both deadlines and schedules can have repeaters.
 "t" 'org-todo
 ;; Cycle heading keywords or list bullet types, or change timestamp by a day
 "H" 'org-shiftleft
 "L" 'org-shiftright
 ;; Move between list items of the same level
 "J" 'org-shiftdown
 "K" 'org-shiftup)

(general-def :keymaps 'org-mode-map
  "<C-tab>" 'org-force-cycle-archived
  "M-h" 'org-metaleft ; Promote/dedent heading/list item
  "M-l" 'org-metaright ; Demote/indent heading/list item
  "M-j" 'org-shiftmetadown ;; Move heading or list item down
  "M-k" 'org-shiftmetaup
  "M-H" 'org-shiftmetaleft ;; Promote/dedent subtrees/sublists
  "M-L" 'org-shiftmetaright
  "M-J" 'org-metadown ;; Move subtree/sublist up/down
  "M-K" 'org-metaup
  ;; Respects lists when filling
  "M-q" 'org-fill-paragraph)

(general-def :keymaps 'org-mode-map :states 'motion
  "RET" 'my/org-open-at-point-in-emacs
  "g" '(:ignore t :wk "Entry navigation")
  "gh" 'outline-previous-visible-heading
  "gl" 'outline-next-visible-heading
  "gk" 'org-backward-heading-same-level
  "gj" 'org-forward-heading-same-level)

;; Does not work as part of general-def. May be related to this:
;; https://github.com/noctuid/general.el#why-dont-some-evil-keybindings-work-immediately
(evil-define-key 'normal org-mode-map
  "Reverses my/org-open-at-point-in-emacs"
  (kbd "DEL") 'org-mark-ring-goto)
  ;; (lambda ()
  ;;   (interactive)
  ;;   (if (equal 1 (length (seq-uniq (cl-subseq org-mark-ring 0
  ;;                                             org-mark-ring-length))))
  ;;       (evil-backward-char)
  ;;     (org-mark-ring-goto))))

(customize-package
