init.org
* company
When used with lsp-mode, company-box provides custom icons and popup documentation to the right of completion items, similar to coc.nvim.

For the love of God, global-company-mode is being modified outside of the custom system, but I cannot fucking figure out where from! I had to ditch it in favor of individual mode activation in :hook. I also couldn't override universal company box mode ~:hook (company-mode . company-box-mode)~, so I switched that to a per-mode setting.

#+begin_src emacs-lisp :tangle yes
  (customize-package
   '(company-frontends
     ;; Remove company-echo-metadata-frontend to speed up candidate navigation
     '(company-pseudo-tooltip-unless-just-one-frontend company-preview-if-just-one-frontend))
   '(company-idle-delay 0)
   '(company-minimum-prefix-length 0.2)
   '(company-selection-wrap-around t)
   '(company-tooltip-align-annotations t)
   '(company-tooltip-limit 20))

  (straight-use-package 'company)

  (customize-package
   '(company-box-doc-enable t)
   '(company-box-enable-icon t))

  (straight-use-package 'company-box)
  (diminish 'company-box-mode)

  (general-def :keymaps 'company-mode-map
    "<tab>" 'company-indent-or-complete-common)

  (general-def :keymaps 'company-active-map
    "C-h" 'mode-specific-C-h
    "M-n"  nil
    "M-p"  nil
    "C-n"  'company-select-next
    "C-p"  'company-select-previous)

  (defun mode-specific-C-h ()
    "Programming language-specific help for company-active-map"
    (interactive)
    (pcase major-mode
      ('ess-r-mode (show-company-doc-as-ess-help))
      (_ (company-show-doc-buffer))))

  (defun show-company-doc-as-ess-help ()
    "Show ess help if available, else show company help"
    (interactive)
    (let* ((selected (nth company-selection company-candidates))
           (obj-help (ess-display-help-on-object selected)))
      (unless obj-help
        (company-show-doc-buffer))))

  (add-hook 'emacs-lisp-mode-hook 'company-mode)
  (add-hook 'emacs-lisp-mode-hook 'company-box-mode)
  (add-hook 'ess-r-mode-hook 'company-mode)

  ;; I disabled ess-r-mode's use of company-box, because the latter would prompt for resolution between objects of the
  ;; same name in different packages, which was extremely aggravating when using the tidyverse.
  ;; (add-hook 'ess-r-mode-hook 'company-box-mode)

  ;; When ess-eldoc-mode is enabled, it vanishes the company completion menu, at least with company-box enabled.
  ;; Did it affect lsp-based company completion? Test this if you ever reenable lsp-mode for ess-r.
  ;; (ess-r-mode . (lambda () (setq ess-eldoc-mode -1)))
#+end_src

* LSP
The VOC inventory .Rmd report was crashing lsp-r for unknown reasons. It could be the size of the file, latex, lsp-mode itself, the R language server, or something else. Note that without lsp-mode, to get full completion you will need to evaluate the loaded libraries in an iess-r buffer, as well as any objects you want completed. Test whether this has been fixed by issue 1383 sometime.

#+BEGIN_SRC emacs-lisp :tangle no
  ;; (use-package lsp-ivy :commands lsp-ivy-workspace-symbol)
  ;; (use-package lsp-treemacs :commands lsp-treemacs-error-list)
  ;; (use-package dap-mode)
  ;; (require 'dap-python)
  ;; Testing out for parameter completion in lsp...
  ;; (use-package yasnippet
  ;;   :hook ((python-mode . yas-minor-mode)
  ;;          (ess-r-mode . yas-minor-mode)))

  (setq read-process-output-max (* 1024 1024)
        lsp-prefer-capf t
        lsp-idle-delay 0.500)

  (customize-package
   '(lsp-auto-guess-root t)
   '(lsp-completion-provider t)
   '(lsp-document-sync-method nil)
   '(lsp-eldoc-enable-hover nil)
   '(lsp-eldoc-render-all nil)
   '(lsp-enable-snippet nil)
   '(lsp-enable-text-document-color t)
   '(lsp-headerline-breadcrumb-enable nil)
   '(lsp-log-io t)
   '(lsp-print-performance t)
   '(lsp-pyls-plugins-jedi-completion-include-params t)
   '(lsp-signature-auto-activate t)
   '(lsp-signature-doc-lines 10)
   '(lsp-signature-render-documentation t))

  (straight-use-package 'lsp-mode)

  (add-hook 'python-mode-hook 'lsp)
  ;; (add-hook 'ess-r-mode-hook 'lsp)
  (add-hook 'lsp-mode 'lsp-enable-which-key-integration)

  (customize-package
   '(lsp-ui-doc-alignment 'window)
   '(lsp-ui-doc-border "#93a1a1")
   '(lsp-ui-doc-enable t)
   '(lsp-ui-doc-header nil)
   '(lsp-ui-doc-include-signature t)
   '(lsp-ui-doc-max-width 150)
   '(lsp-ui-doc-position 'top)
   '(lsp-ui-doc-use-childframe t)
   '(lsp-ui-doc-use-webkit nil)
   '(lsp-ui-sideline-enable nil)
   '(lsp-ui-sideline-show-code-actions nil)
   '(lsp-ui-sideline-show-diagnostics nil)
   '(lsp-ui-sideline-show-hover t)
   '(lsp-ui-sideline-show-symbol nil)
   '(lsp-ui-sideline-update-mode 'point))

  (straight-use-package 'lsp-ui)

  (general-def '(motion insert emacs)
   "C-f" 'scroll-down-lsp-ui)

  ;; Disable underlines in lsp-ui-doc child frames
  (custom-set-faces '(nobreak-space ((t nil))))

  (defun scroll-down-lsp-ui ()
    "Enable scrolling documentation child frames when using lsp-ui-doc-glance"
    (interactive)
    (if (lsp-ui-doc--frame-visible-p)
        (let ((kmap (make-sparse-keymap)))
          (define-key kmap (kbd "q")
            '(lambda ()
               (interactive)
               (lsp-ui-doc-unfocus-frame)
               (setq overriding-terminal-local-map nil)
               (setq which-key-show-transient-maps t)))
          (setq which-key-show-transient-maps nil)
          (setq overriding-terminal-local-map kmap)
          (lsp-ui-doc-focus-frame)))
    (evil-scroll-page-down 1))
#+END_SRC

** TODO Finish setting up lsp package extensions,
** TODO Test DAP for R and Python

* elisp
#+BEGIN_SRC emacs-lisp :tangle yes
  (general-define-key
   :prefix-command 'my/elisp-map
   "c" 'check-parens            ; Debugging "End of file during parsing"
   ;; evals outermost expression containing or following point
   ;; ...and forces reset to initial value within a defvar,
   ;; defcustom, and defface expressions
   "d" 'eval-defun
   "m" 'pp-eval-expression      ; "m" for minibuffer, where exp is evaluated
   "s" 'pp-eval-last-sexp       ; evals expression preceding point
   "i" 'eval-print-last-sexp    ; "i" for insert(ing result)
   "r" 'eval-region)

  (my-leader :keymaps 'emacs-lisp-mode-map "m" 'my/elisp-map)
#+END_SRC

* R(markdown)
  Major-mode binding (i.e., ~(my-leader :keymaps 'ess-r-mode-map "m" 'hydra-r/body)~) is more efficient than buffer-local binding (i.e., ~(my-leader :keymaps 'local "m" 'hydra-r/body)~) in the body of a hook (i.e., ~config-ess-r-mode~).

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq ess-nuke-trailing-whitespace-p t
        ;; ess-S-quit-kill-buffers-p 'ask
        inhibit-field-text-motion nil) ; prompt acts as beginning of line if prompt is read-only

  (customize-package
   '(comint-prompt-read-only t) ; Read-only prompt (\">\" in ess-R)
   '(comint-use-prompt-regexp nil) ; nil enables evil motions
   '(comint-scroll-show-maximum-output t)
   '(comint-scroll-to-bottom-on-input t)
   '(ess-ask-for-ess-directory nil)
   '(ess-eldoc-abbreviation-style 'mild)
   ;; Show function signature in echo area when inside function and on symbol. May not show until first argument has been
   ;; completed.
   '(ess-eldoc-show-on-symbol t)
   '(ess-eval-visibly nil)
   ;; I suspect this is the reason comments were forced toward the right margin in R scripts
   '(ess-indent-with-fancy-comments nil)
   '(ess-use-company t) ; How does this differ from adding company-mode to ess-r-mode-hook???
   '(ess-style 'RStudio))

  (straight-use-package 'ess)

  (my-leader :keymaps 'ess-r-mode-map "m" 'hydra-r/body)

  (add-hook 'ess-r-mode-hook 'config-ess-r-mode)

  (defun config-ess-r-mode ()
    (ess-set-style 'RStudio)
    ;; (setq-local ess-indent-offset 4) ; RStudio style uses a value of 2

    ;; Rely on electric-pair-mode instead of skeleton
    (local-set-key (kbd "{") 'self-insert-command)
    (local-set-key (kbd "}") 'self-insert-command)

    ;; electric-layout-rules interferes with ess-roxy-newline-and-indent
    ;; if electric-layout-mode is enabled (it is not by default)
    (setq-local electric-layout-rules nil))

  ;; Override Windows' help_type option of "html", to open help in help buffer, not browser (see contents of .Rprofile)
  (pcase system-type
    ('windows-nt
     ;; iESS searches the paths listed in the variable exec-path for inferior-ess-r-program
     (add-to-list 'exec-path "c:/Users/jkroes/Documents/R/R-3.6.2/bin")
     ;; Sets R_USER and R_LIBS_USER
     (setenv "R_USER" "c:/Users/jkroes/Documents")
     ;; run-ess-r fails when this is set to Rterm
     (setq inferior-ess-r-program "R")
     (setenv "R_PROFILE_USER" "C:/Users/jkroes/.emacs.d/.Rprofile")
     ;; RStudio downloads pandoc with rmarkdown, but outside of RStudio
     ;; you need to notify R of the executable's directory
     (setenv "RSTUDIO_PANDOC" "C:/Users/jkroes/AppData/Local/Pandoc"))
    ('darwin (setenv "R_PROFILE_USER" "~/.emacs.d/.Rprofile")))

  (straight-use-package 'poly-markdown)

  ;; NOTE: ess-r configuration and bindings are available inside chunks, where R-mode is active
  ;; I have bound polymode-export (render) to SPC-m-e-k
  (straight-use-package 'poly-R)

  ;; Prevent window displaying company documentation buffer from vanishing when invoking a binding not in
  ;; company--electric-commands
  ;; (defun forget-saved-window-config ()
  ;;   (setq company--electric-saved-window-configuration nil))
  ;; (advice-add 'company-pre-command :before 'forget-saved-window-config)
#+END_SRC

