init.el
 '(company-frontends
   ;; Remove company-echo-metadata-frontend to speed up candidate navigation
   '(company-pseudo-tooltip-unless-just-one-frontend company-preview-if-just-one-frontend))
 '(company-idle-delay 0)
 '(company-minimum-prefix-length 0.2)
 '(company-selection-wrap-around t)
 '(company-tooltip-align-annotations t)
 '(company-tooltip-limit 20))

(straight-use-package 'company)

(customize-package
 '(company-box-doc-enable t)
 '(company-box-enable-icon t))

(straight-use-package 'company-box)
(diminish 'company-box-mode)

(general-def :keymaps 'company-mode-map
  "<tab>" 'company-indent-or-complete-common)

(general-def :keymaps 'company-active-map
  "C-h" 'mode-specific-C-h
  "M-n"  nil
  "M-p"  nil
  "C-n"  'company-select-next
  "C-p"  'company-select-previous)

(defun mode-specific-C-h ()
  "Programming language-specific help for company-active-map"
  (interactive)
  (pcase major-mode
    ('ess-r-mode (show-company-doc-as-ess-help))
    (_ (company-show-doc-buffer))))

(defun show-company-doc-as-ess-help ()
  "Show ess help if available, else show company help"
  (interactive)
  (let* ((selected (nth company-selection company-candidates))
         (obj-help (ess-display-help-on-object selected)))
    (unless obj-help
      (company-show-doc-buffer))))

(add-hook 'emacs-lisp-mode-hook 'company-mode)
(add-hook 'emacs-lisp-mode-hook 'company-box-mode)
(add-hook 'ess-r-mode-hook 'company-mode)

;; I disabled ess-r-mode's use of company-box, because the latter would prompt for resolution between objects of the
;; same name in different packages, which was extremely aggravating when using the tidyverse.
;; (add-hook 'ess-r-mode-hook 'company-box-mode)

;; When ess-eldoc-mode is enabled, it vanishes the company completion menu, at least with company-box enabled.
;; Did it affect lsp-based company completion? Test this if you ever reenable lsp-mode for ess-r.
;; (ess-r-mode . (lambda () (setq ess-eldoc-mode -1)))

(general-define-key
 :prefix-command 'my/elisp-map
 "c" 'check-parens            ; Debugging "End of file during parsing"
 ;; evals outermost expression containing or following point
 ;; ...and forces reset to initial value within a defvar,
 ;; defcustom, and defface expressions
 "d" 'eval-defun
 "m" 'pp-eval-expression      ; "m" for minibuffer, where exp is evaluated
 "s" 'pp-eval-last-sexp       ; evals expression preceding point
 "i" 'eval-print-last-sexp    ; "i" for insert(ing result)
 "r" 'eval-region)

(my-leader :keymaps 'emacs-lisp-mode-map "m" 'my/elisp-map)

(setq ess-nuke-trailing-whitespace-p t
      ;; ess-S-quit-kill-buffers-p 'ask
      inhibit-field-text-motion nil) ; prompt acts as beginning of line if prompt is read-only

(customize-package
 '(comint-prompt-read-only t) ; Read-only prompt (\">\" in ess-R)
 '(comint-use-prompt-regexp nil) ; nil enables evil motions
 '(comint-scroll-show-maximum-output t)
 '(comint-scroll-to-bottom-on-input t)
 '(ess-ask-for-ess-directory nil)
 '(ess-eldoc-abbreviation-style 'mild)
 ;; Show function signature in echo area when inside function and on symbol. May not show until first argument has been
 ;; completed.
 '(ess-eldoc-show-on-symbol t)
 '(ess-eval-visibly nil)
 ;; I suspect this is the reason comments were forced toward the right margin in R scripts
 '(ess-indent-with-fancy-comments nil)
 '(ess-use-company t) ; How does this differ from adding company-mode to ess-r-mode-hook???
 '(ess-style 'RStudio))

(straight-use-package 'ess)

(my-leader :keymaps 'ess-r-mode-map "m" 'hydra-r/body)

(add-hook 'ess-r-mode-hook 'config-ess-r-mode)

(defun config-ess-r-mode ()
  (ess-set-style 'RStudio)
  ;; (setq-local ess-indent-offset 4) ; RStudio style uses a value of 2

  ;; Rely on electric-pair-mode instead of skeleton
  (local-set-key (kbd "{") 'self-insert-command)
  (local-set-key (kbd "}") 'self-insert-command)

  ;; electric-layout-rules interferes with ess-roxy-newline-and-indent
  ;; if electric-layout-mode is enabled (it is not by default)
  (setq-local electric-layout-rules nil))

;; Override Windows' help_type option of "html", to open help in help buffer, not browser (see contents of .Rprofile)
(pcase system-type
  ('windows-nt
   ;; iESS searches the paths listed in the variable exec-path for inferior-ess-r-program
   (add-to-list 'exec-path "c:/Users/jkroes/Documents/R/R-3.6.2/bin")
   ;; Sets R_USER and R_LIBS_USER
   (setenv "R_USER" "c:/Users/jkroes/Documents")
   ;; run-ess-r fails when this is set to Rterm
   (setq inferior-ess-r-program "R")
   (setenv "R_PROFILE_USER" "C:/Users/jkroes/.emacs.d/.Rprofile")
   ;; RStudio downloads pandoc with rmarkdown, but outside of RStudio
   ;; you need to notify R of the executable's directory
   (setenv "RSTUDIO_PANDOC" "C:/Users/jkroes/AppData/Local/Pandoc"))
  ('darwin (setenv "R_PROFILE_USER" "~/.emacs.d/.Rprofile")))

;; Disabling this while I render Word documents from Rmarkdown.
(customize-package '(polymode-display-output-file nil))

(straight-use-package 'poly-markdown)

;; NOTE: ess-r configuration and bindings are available inside chunks, where R-mode is active
;; I have bound polymode-export (render) to SPC-m-e-k
(straight-use-package 'poly-R)

;; Prevent window displaying company documentation buffer from vanishing when invoking a binding not in
;; company--electric-commands
;; (defun forget-saved-window-config ()
;;   (setq company--electric-saved-window-configuration nil))
;; (advice-add 'company-pre-command :before 'forget-saved-window-config)
