init.org
* Terminal and shell scripts
#+BEGIN_SRC emacs-lisp :tangle yes
  (straight-use-package 'fish-mode)

  ;; Modified ansi-term to avoid read-from-minibuffer prompt
  (setq explicit-shell-file-name "/usr/bin/fish")

  (defun clear-shell ()
    (interactive)
    (let ((old-max comint-buffer-maximum-size))
      (setq comint-buffer-maximum-size 0)
      (comint-truncate-buffer)
      (setq comint-buffer-maximum-size old-max)))

  (global-set-key  (kbd "\C-x c") 'clear-shell)

  ;; TODO: Throws an error on window. Commenting out in the meantime.

  ;; (defun ansi-term (program &optional new-buffer-name)
  ;;   "Start a terminal-emulator in a new buffer.
  ;; This is almost the same as `term' apart from always creating a new buffer,
  ;; and `C-x' being marked as a `term-escape-char'."
  ;; (interactive (list (or explicit-shell-file-name (getenv "ESHELL") shell-file-name)))

  ;;   ;; Pick the name of the new buffer.
  ;;   (setq term-ansi-buffer-name
  ;;     (if new-buffer-name
  ;;         new-buffer-name
  ;;       (if term-ansi-buffer-base-name
  ;;           (if (eq term-ansi-buffer-base-name t)
  ;;           (file-name-nondirectory program)
  ;;         term-ansi-buffer-base-name)
  ;;         "ansi-term")))

  ;;   (setq term-ansi-buffer-name (concat "*" term-ansi-buffer-name "*"))

  ;;   ;; In order to have more than one term active at a time
  ;;   ;; I'd like to have the term names have the *term-ansi-term<?>* form,
  ;;   ;; for now they have the *term-ansi-term*<?> form but we'll see...

  ;;   (setq term-ansi-buffer-name (generate-new-buffer-name term-ansi-buffer-name))
  ;;   (setq term-ansi-buffer-name (term-ansi-make-term term-ansi-buffer-name program))

  ;;   (set-buffer term-ansi-buffer-name)
  ;;   (term-mode)
  ;;   (term-char-mode)

  ;;   ;; Historical baggage.  A call to term-set-escape-char used to not
  ;;   ;; undo any previous call to t-s-e-c.  Because of this, ansi-term
  ;;   ;; ended up with both C-x and C-c as escape chars.  Who knows what
  ;;   ;; the original intention was, but people could have become used to
  ;;   ;; either.   (Bug#12842)
  ;;   (let (term-escape-char)
  ;;     ;; I wanna have find-file on C-x C-f -mm
  ;;     ;; your mileage may definitely vary, maybe it's better to put this in your
  ;;     ;; .emacs ...
  ;;     (term-set-escape-char ?\C-x))

  ;;   (switch-to-buffer term-ansi-buffer-name))
#+END_SRC


* file browsers

Use ranger for general file browsing and treemacs as your workspace/project sidebar.

** treemacs
Inspiration from https://github.com/lepisma/rogue.

To toggle treemacs, use C-\. To switch to a treemacs window, use C-|. You can use normal windmove commands to move out of the window, just not in, per the current setting of ~treemacs-is-never-other-window~. The upside of this is that, e.g., delete-other-windows ignores treemacs.

_If general-def isn't working, use general-define-key as done below._

#+BEGIN_SRC emacs-lisp :tangle yes
  (straight-use-package 'all-the-icons)

  ;; Customize node was showing nothing when expanded. Literally empty space. Set here instead.
  ;; To see other values for this setting, press "o" over a file node in treemacs.
  (setq treemacs-default-visit-action 'treemacs-visit-node-ace)

  (customize-package
   '(treemacs-filewatch-mode t)
   '(treemacs-follow-mode t)
   '(treemacs-fringe-indicator-mode t)
   '(treemacs-git-mode 'deferred)
   '(treemacs-is-never-other-window t)
   '(treemacs-user-mode-line-format 'none)
   '(treemacs-workspace-switch-cleanup 'all))

  (straight-use-package 'treemacs)
  (require 'treemacs)

  (add-hook 'treemacs-mode (lambda () (display-line-numbers-mode -1)))

  (autoload 'treemacs-load-theme "treemacs-themes")
  (load "doom-themes-ext-treemacs") ; See treemacs-create-theme declarations
  (treemacs-load-theme "doom-colors")

  (general-define-key :keymaps '(motion insert emacs)
    "C-\\" 'treemacs
    "C-|" 'treemacs-select-window)

  (general-define-key :keymaps 'my/files-map
    "p" '(:keymap treemacs-project-map)
    "w" '(:keymap treemacs-workspace-map))

  (straight-use-package 'treemacs-evil)
  (require 'treemacs-evil)
#+END_SRC

** TODO Find a way to use :wk for treemacs project and workspace (without interfering with descriptoin of hydra-window)
** TODO Find a repository of treemacs themes. They seem hard to find on their own, disconnected from the rest of the repositories that contain theme code. In particular, I like the rogue spacing and simple icons (repos, folders, text files, and code files).
** TODO Find a way to commit different ~/.emacs.d/.cache/treemacs-persist for different computers.
** TODO Check out integration of treemacs with org-store-link
** TODO Any compelling reason to use treemacs-projectile?
** TODO Checkout  magit and treemacs-magit.

** ranger
#+begin_src emacs-lisp :tangle yes
  (customize-package
   '(ranger-deer-show-details nil)
   '(ranger-override-dired-mode t)
   '(ranger-show-hidden t))

  (straight-use-package 'ranger)

  (my-leader "r" 'ranger)
  ;; (add-hook 'ranger-mode-hook 'hide-mode-line)
#+end_src
*** TODO Ranger launches in ansi-term but opens files in nano(?). Find a way to integrate it so you can open files in the buffer occupied by ansi-term/ranger instead, then replace deer.
* Notes                                                             :ARCHIVE:
** Installation
*** emacs
**** [[info:efaq#Installing Emacs][From source]]
To get the latest version, install from alpha.gnu.org/gnu/emacs/pretest. If installing .xz instead of .gz, drop the -g flag.

**** [[https://launchpad.net/~kelleyk/+archive/ubuntu/emacs][Ubuntu]]
#+BEGIN_SRC sh :tangle no
  sudo add-apt-repository ppa:kelleyk/emacs
  sudo apt-get update
#+END_SRC

*** hack font
**** [[https://github.com/source-foundry/Hack#quick-installation][Manual]]

**** Ubuntu
#+BEGIN_SRC sh :tangle no
  sudo apt-get update
  sudo apt-get install fonts-hack
#+END_SRC

*** counsel
**** ripgrep (rg)
**** fzf

*** projectile
**** fd-find (fdfind)
**** ripgrep (rg)

*** treemacs
Run ~(all-the-icons-install-fonts)~
Doom theme should already be present in .emacs.d/lisp.

** (Auto)loads, require, and void functions or variables

straight-use-package registers, clones (to .emacs.d/straight/repos/), builds (to .emacs.d/straight/build/), and loads your package. Loading means adding the package to the load-path and evaluating the package's autoload file, which is created by straight.el in the build folder.

To use a packaged function in this config without generating a void function error, a package must have been loaded and must provide the function as an autoload. If an autoload is not created by the package, you can create an autoload before using the function. If you don't want to create an autoload, you must instead ~require~ the package.

You can use functions like ~boundp~ and ~bound-and-true-p~ to protect against void-variable errors for variables and customizable options, or you can create and set the variable in advance of the package loading. In fact, customizable options must sometimes be set in advance of the package loading for the set value to take effect (more on this below).

** Customization

*** TL;DR

I use custom-theme-set-variables and a non-~user~ theme to set options, and setq otherwise. I use both prior to loading a package, unless I need to change an option on the fly.

setq before a package is loaded is USUALLY eqivalent to custom-set-variables, because the package will run the :set function the first time its defcustom statements are evaluated, substituting any customized or non-customized value for the default value to pass to the :set function. The one exception is if defcustom relies on ~:initialize custom-initialize-set~. After a package is loaded, however, you will need to use custom-set-variables to trigger :set again.

For barebones options--those without any keyword options--there is no difference between setq and custom-set-variables. Whether or not setting an option before or after a package is loaded are equally valid depends on the package's full code (see which-key).

If a variable or option aren't what you expect: check that the value is a permissible value for an option whose defcustom includes a :type or :option keyword, check whether you setq or customized before the package was loaded, check the keywords of the defcustom for an option, check whether the variable or option is buffer-local, and check whether any other package or section of your config file sets or customizes the variable or option.

*** User Interface

~customize~ invokes the customization UI, where you can set the value of customizable user options. Options are also indicated in help buffers by the text "You can customize this variable." At the heart of the UI is ~custom-set-variables~, which is either written by the UI to the end of init.el or in an external ~custom-file~. An important distinction between e.g. ~setq~ and ~custom-set-variables~ is that ~setq~ sets the value of a void symbol, and ~custom-set-variables~ only sets or modifies the property-list. See [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Symbol-Components.html#Symbol-Components][9.1 Symbol Components]]. For this reason, a customized option that has not yet had its associated ~defcustom~ evaluated will throw a void-variable error. If the symbol is not previously void, custom-set-variables will update its value. Otherwise, a customized option's value will be set once its associated ~defcustom~ is evaluated, usually when the package defining it is loaded.

The UI offers alternatives for setting options changed in a UI session: "Apply" and "Apply and save". The former customization is specific to the current emacs session; the latter saves the customization for future sessions. The former sets the ~customized-value~ and ~backup-value~ properties of the option symbol; the latter sets the ~saved-value~ property. Both set the ~user~ portion of the theme-value property. See [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Variable-Definitions.html][15.3 Defining Customization Variables (directly after Function: custom-add-frequent-value)]].

*** defcustom

In its simplest form, ~defcustom~ is similar to ~defvar~ in that it only sets a variable to a default value if the symbol is void (i.e., has no value), but it additionally ignores the default value if the ~saved-value~ property is set. The default value is stored in the ~standard-value~ property. See the source of custom.el (~defun custom-initialized-*~).

#+begin_src emacs-lisp :tangle no
  (put 'is-saved 'saved-value '(1))
  (defcustom is-saved 2 "")
  is-saved ;; 1
#+end_src

To actually set a variable, the :set function is used, while the :initialize function determines under what conditions to use the :set function. See [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Variable-Definitions.html][15.3 Defining Customization Variables]].

**** :set

custom-set-variables invokes the :set keyword of defcustom, unlike setq. Many packages omit this keyword, which defaults to using set-default. The value passed to it is determined by the ~saved-value~ property, the bound value, and the default value specified in ~defcustom~, in that order. The setter function is contained in the ~custom-set~ property of an option.

Note that there is nothing blocking defcustom from completely ignoring the value passed to it--nothing aside from good coding practice. Take the following example:

#+begin_src emacs-lisp :tangle no
  (custom-set-variables
   '(tricky 1))

  (defcustom tricky 2 ""
    :set (lambda (symbol value)
           (set-default symbol 3)))
#+end_src

The value of ~tricky~ is 3, not 1 as the user customizing the option likely hoped. We could have gone further and used an entirely unrelated symbol (e.g., ~'trickier~) in lieu of ~symbol~.

