init.el

(straight-use-package 'fish-mode)

;; Modified ansi-term to avoid read-from-minibuffer prompt
(setq explicit-shell-file-name "/usr/bin/fish")

(defun clear-shell ()
  (interactive)
  (let ((old-max comint-buffer-maximum-size))
    (setq comint-buffer-maximum-size 0)
    (comint-truncate-buffer)
    (setq comint-buffer-maximum-size old-max)))

(global-set-key  (kbd "\C-x c") 'clear-shell)

;; TODO: Throws an error on window. Commenting out in the meantime.

;; (defun ansi-term (program &optional new-buffer-name)
;;   "Start a terminal-emulator in a new buffer.
;; This is almost the same as `term' apart from always creating a new buffer,
;; and `C-x' being marked as a `term-escape-char'."
;; (interactive (list (or explicit-shell-file-name (getenv "ESHELL") shell-file-name)))

;;   ;; Pick the name of the new buffer.
;;   (setq term-ansi-buffer-name
;;     (if new-buffer-name
;;         new-buffer-name
;;       (if term-ansi-buffer-base-name
;;           (if (eq term-ansi-buffer-base-name t)
;;           (file-name-nondirectory program)
;;         term-ansi-buffer-base-name)
;;         "ansi-term")))

;;   (setq term-ansi-buffer-name (concat "*" term-ansi-buffer-name "*"))

;;   ;; In order to have more than one term active at a time
;;   ;; I'd like to have the term names have the *term-ansi-term<?>* form,
;;   ;; for now they have the *term-ansi-term*<?> form but we'll see...

;;   (setq term-ansi-buffer-name (generate-new-buffer-name term-ansi-buffer-name))
;;   (setq term-ansi-buffer-name (term-ansi-make-term term-ansi-buffer-name program))

;;   (set-buffer term-ansi-buffer-name)
;;   (term-mode)
;;   (term-char-mode)

;;   ;; Historical baggage.  A call to term-set-escape-char used to not
;;   ;; undo any previous call to t-s-e-c.  Because of this, ansi-term
;;   ;; ended up with both C-x and C-c as escape chars.  Who knows what
;;   ;; the original intention was, but people could have become used to
;;   ;; either.   (Bug#12842)
;;   (let (term-escape-char)
;;     ;; I wanna have find-file on C-x C-f -mm
;;     ;; your mileage may definitely vary, maybe it's better to put this in your
;;     ;; .emacs ...
;;     (term-set-escape-char ?\C-x))

;;   (switch-to-buffer term-ansi-buffer-name))

(straight-use-package 'all-the-icons)

;; Customize node was showing nothing when expanded. Literally empty space. Set here instead.
;; To see other values for this setting, press "o" over a file node in treemacs.
(setq treemacs-default-visit-action 'treemacs-visit-node-ace)

(customize-package
 '(treemacs-filewatch-mode t)
 '(treemacs-follow-mode t)
 '(treemacs-fringe-indicator-mode t)
 '(treemacs-git-mode 'deferred)
 '(treemacs-is-never-other-window t)
 '(treemacs-user-mode-line-format 'none)
 '(treemacs-workspace-switch-cleanup 'all))

(straight-use-package 'treemacs)
(require 'treemacs)

(add-hook 'treemacs-mode (lambda () (display-line-numbers-mode -1)))

(autoload 'treemacs-load-theme "treemacs-themes")
(load "doom-themes-ext-treemacs") ; See treemacs-create-theme declarations
(treemacs-load-theme "doom-colors")

(general-define-key :keymaps '(motion insert emacs)
  "C-\\" 'treemacs
  "C-|" 'treemacs-select-window)

(general-define-key :keymaps 'my/files-map
  "p" '(:keymap treemacs-project-map)
  "w" '(:keymap treemacs-workspace-map))

(straight-use-package 'treemacs-evil)
(require 'treemacs-evil)

(customize-package
 '(ranger-deer-show-details nil)
 '(ranger-override-dired-mode t)
 '(ranger-show-hidden t))

(straight-use-package 'ranger)

(my-leader "r" 'ranger)
;; (add-hook 'ranger-mode-hook 'hide-mode-line)
