init.org
**** :initialize
When ~:initialize~ is ~custom-initialize-set~, evaluating the defcustom will only run the setter function for void variables. Thus, only setting an option's value through ~custom-set-options~ will allow you to run the setter function with a non-default value. ~setq~ will not.

The other two keyword values (~custom-initialize-reset~ and ~custom-initialize-changed~) produce equivalent results for ~setq~ and ~custom-set-variables~, assuming setq is used prior to evaluating defcustom. The former always invokes ~:set~ when the ~defcustom~ is evaluated, while the latter does so for "changed" variables (bound or customized), and ~set-default~ for void, uncustomized variables.

*** custom-reevaluate-setting

A call to custom-reevalute-setting will reset the option to its saved value through the customization system or its standard value. In this case, setq may be overriden, whereas an option set through custom-set-variables would not be. See [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Variable-Definitions.html#Variable-Definitions][defining customization variables]].

#+begin_src emacs-lisp :tangle yes
  (custom-set-variables '(hair 1))
  (defcustom hair 2 "")
  (setq hair 3)
  (custom-reevaluate-setting 'hair) ; 1

  (setq hare 1)
  (defcustom hare 2 "")
  (setq hare 3)
  (custom-reevaluate-setting 'hare) ; 2
#+end_src

*** which-key

**** TL;DR

Just using customize over setq for options isn't always enough. Sometimes the values need to be set before a package is loaded, because the package code doesn't properly update the options for later customization.

**** Details

There is a known bug with which-key-echo-keystrokes (wkek). If it is greater than the value of which-key-idle-delay (wkid), the value of which-key-idle-delay seems to be ignored. The actual delay seems to be about 4x the value of wkek. The defcustom for wkek uses a default value of 1/4 of wkid's value. This value is evaluated at the time of wkek's defcustom definition, so the value of wkid needs to be set before which-key.el is loaded, in order to set wkek to a compatible value. Luckily the documentation notes that you should set this variable before loading which-key.

Test results:
1. Using (init-custom-set 'which-key-idle-delay 0.2)
   which-key-idle-delay: 1 -> 0.2
   which-key-echo-keystrokes: 0.05 -> 0.25 (1/4 of wkid's standard value)
2. Using (setq which-key-idle-delay 0.2)
   which-key-idle-delay: 1 -> 0.2
   which-key-echo-keystrokes: 0.05 (1/4 of wkid's altered value)

Note that which-key--setup-echo-keystrokes is called to reset which-key-echo-keystrokes in response to calling which-key-mode, which-key-setup-side-window-bottom, and which-key-setup-minibuffer--none of which ensure it has the right setting based on the current setting of which-key-idle-delay.

The best option for which-key developers in the future may be to use a :set function for wkid that updates wkek when wkid changes. That way, wkid's reverse dependencies are never out of sync. Maybe even add an option to disable update of future dependencies for users who want to set those options themselves.

*** DEPRECATED: csetq

An early solution for a setter that works for both variables and options is abo abo's csetq macro, now in wide use. It checks symbols for a ~custom-set~ symbol property, invoking its value if the property is set. My issue 856 for use-package revealed that :custom failed to customize minor mode variables properly. PR 881 aimed to fix that by using custom-theme-set-variables, around which custom-set-variables is a thin wrapper.

*** Random Sources

https://www.reddit.com/r/emacs/comments/exnxha/withemacs_almost_all_you_need_to_know_about/
https://stackoverflow.com/questions/22915019/emacs-setq-before-loading
https://www.gnu.org/software/emacs/manual/html_node/emacs/Locals.html#Locals
https://www.gnu.org/software/emacs/manual/html_node/eintr/defcustom.html#defcustom
https://www.gnu.org/software/emacs/manual/html_node/elisp/Customization.html#Customization (Writing defcustoms)
https://www.reddit.com/r/emacs/comments/67pzh5/using_customsetvariables_programmatically/
https://opensource.com/article/20/3/variables-emacs
http://emacs.1067599.n8.nabble.com/which-one-to-use-custom-set-variables-customize-set-variable-or-customize-set-value-td378730.html
Top answer for https://emacs.stackexchange.com/questions/102/advantages-of-setting-variables-with-setq-instead-of-custom-el
See claim that custom-set-variables is equivalent to csetq, but also the first comment thread: https://oremacs.com/2015/01/17/setting-up-ediff/
https://www.reddit.com/r/emacs/comments/g46sg2/a_solution_to_the_agony_of_customsetvariables_and/ Ignore the article and focus on the comments. They discuss using a garbage custom file (good if you use customize-set-variable and/or custom-set-variables instead of csetq. One person also recommends using (when (featurep 'PACKAGE-autoloads) ...) in lieu of use-package's :demand, :defer, :after, etc., keywords, to detect if a package has been installed with the relevant autoloads file. This can be used if a package will be installed later, as opposed to detecting if a package has already been loaded.

* Local Variables
# Local Variables:
# eval: (add-hook 'after-save-hook (lambda ()(org-babel-tangle)) nil t)
# End:
