init.el

(custom-set-variables '(hair 1))
(defcustom hair 2 "")
(setq hair 3)
(custom-reevaluate-setting 'hair) ; 1

(setq hare 1)
(defcustom hare 2 "")
(setq hare 3)
(custom-reevaluate-setting 'hare) ; 2
